block1 = [["Цель должности"], [
        '''
        1.	Решение задач поддержки функционирования портальных и интернет-систем.
        2.	Управление конфигурациями портальных и интернет-систем.
        3.	Разрешение инцидентов, связанных с работой портальных и интернет-систем.
        4.	Решение задач внедрения, тиражирования и технологического развития портальных и интернет-систем.
        5.	Решение задач интеграции портальных и интернет-систем с другими системами и источниками данных.
        6.	Разработка ИТ-решений и информационных систем в части проведения бизнес-аналитики и формирования технического задания
        7.	Создание, разработка, развитие и внедрение ИТ-решений и информационных систем в части программной роботизации
        8.	Сопровождение и эксплуатация ИТ-решений и информационных систем в соответствии с соглашениями об уровне обслуживания
        '''
    ]]

row21 = [["20%"], [
            '''
            Решение инцидентов, связанных с прикладными системами:
            •	решение проблем, формирование обходных решений;
            •	консультация пользователей;
            •	анализ и формирование требований по развитию системы;
            '''
        ]]
row22 = [["80%"], [
            '''
            •	Разработка веб решений на основе сиcтемы Bitrix
            •	Разработка фронт решений на основе фреймворка vuejs/react
            •	Разработка интерфейсов, компонентов, верстка
            •	Тестирование и отладка функционала 
            •	Поддержка и рефакторинг существующих веб решений;
            •	Выполнение других поручений руководителей
            Разработка регламентных и технических документов
            '''
        ]]
block2 = [["Основные обязанности"], [row21, row22]]
block3 = [["Образование"], ["Среднее, высшее, неоконченное высшее в сфере ИТ"]]
block4 = [["Опыт"], ["без профильного опыта работы"]]
block5 = [["Гостайна"], ["В соответствии с номенклатурой должностей"]]
block6 = [["Знания"], [ '''
                        •	Отличные знания php и Bitrix
                        •	Vue.JS, TypeScript, Vuex, SASS/LESS
                        •	Отличные знания Javascript(ES6+), HTML5, CCS3
                        •	Опыт работы по Scrum/Agile
                        •	Владение инструментарием автоматизации тестирования
                        •	Работа на уровне продвинутого пользователя Windows/Linux. 
                        •	Знание архитектуры, устройства и принцип функционирования вычислительных систем
                        •	Основы информационной безопасности web-ресурсов
                        •	Основы современных систем управления базами данных
                        •	Сетевые протоколы и основы web-технологий;
                        
                        Личностно-деловые качества:
                        •	ответственность;
                        •	внимательность;
                        •	быстрая обучаемость;
                        •	коммуникабельность;
                        •	исполнительность;
                        •	нацеленность на результат.
                        ''']]
block7 = [["Языки"], ["Английский, чтение технической литературы в области ИТ, со словарем"]]
block8 = [["Знания ПО"], [  '''•	MS Office (Excel, Word, Visio)
                            •	Операционные системы Windows
                            •	Gitlab / Jira / Confluence / OpenProject / AzureDevops
                            ''']]

rules = [
    [["специалист"], block1],
    [["специалист"], block2],
    [["специалист"], block3],
    [["специалист"], block4],
    [["специалист"], block5],
    [["специалист"], block6],
    [["специалист"], block7],
    [["специалист"], block8],
]